---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PlacementParamsShow
source: html/a15c454e-2bc2-c9e5-1f15-78b5e7dddc0b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PlacementParamsShow Property

"Enable Position Parameters"

## Syntax (C#)
```csharp
public static ForgeTypeId PlacementParamsShow { get; }
```